БИТУправление_медицинским_центром_демо/src/InformationRegisters/СообщенияЭлектроннойПочты/СообщенияЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияЭлектроннойПочты</name>
  <resources>
    <name>КонтактПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическойОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоОтправил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияОбОтправке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <comment>Внешний идентификатор сообщения, для связи с сервисом</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаПисемEmail</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСообщения</name>
    <type>
      <types>CatalogRef.ВидыСообщенийРассылки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнутреннийИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусОтправки</name>
    <type>
      <types>EnumRef.СтатусыОтправкиСообщений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/СтатусыОтправкиСообщений/СтатусыОтправкиСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтправкиСообщений</name>
  <enumValues>
    <name>НеОтправлено</name>
  </enumValues>
  <enumValues>
    <name>Отправлена</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/РассылкаПисемEmail/РассылкаПисемEmail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РассылкаПисемEmail</name>
  <attributes>
    <name>УчетнаяЗапись</name>
    <comment>Учетная запись электронной почты</comment>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ПисьмоEMAIL</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставитьСообщениеВУказанноеВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись</description>
    </items>
  </predefined>
  <attributes>
    <name>SMTPАутентификация</name>
    <type>
      <types>EnumRef.ВариантыSMTPАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезопасныйВходНаСерверВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезопасныйВходНаСерверИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХраненияСообщенийНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособPOP3Аутентификации</name>
    <type>
      <types>EnumRef.СпособыPOP3Аутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьSSLSMTP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьSSLPOP3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособSMTPАутентификации</name>
    <type>
      <types>EnumRef.СпособыSMTPАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходНаСерверПередОтправкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСкрытыеКопииПисемНаЭтотАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецУчетнойЗаписи</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/CommonModules/РассылкаСообщенийEMAIL/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СоздатьДокументРассылка(ПараметрыСообщения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяРассылка = Документы.РассылкаПисемEmail.СоздатьДокумент();
	НоваяРассылка.СозданАвтоматически = Истина;
	НоваяРассылка.Дата = ТекущаяДата();                                                          
	НоваяРассылка.СозданАвтоматически	= Истина;
	НоваяРассылка.УчетнаяЗапись	= Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	НоваяРассылка.Шаблон = ПараметрыСообщения.ВидСообщения.ШаблонEMAIL;
	
	НоваяРассылка.ДоставитьСообщениеВУказанноеВремя = ПараметрыСообщения.ДоставитьСообщениеВУказанноеВремя;
	НоваяРассылка.ДатаОтправки = ПараметрыСообщения.ДатаОтправки;
	
	НоваяРассылка.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НоваяРассылка.Ссылка;
	
КонецФункции

Функция ОтправитьНеотправленныеСообщения(ДокументРассылки) Экспорт
		
	Если ДокументРассылки.Проведен Тогда
		
		НаборЗаписейСообщения = РегистрыСведений.СообщенияЭлектроннойПочты.СоздатьНаборЗаписей();
		НаборЗаписейСообщения.Отбор.Рассылка.Установить(ДокументРассылки.Ссылка);
		НаборЗаписейСообщения.Прочитать();
					
		ТаблицаСообщенийДокумента = НаборЗаписейСообщения.Выгрузить();
		
		ТаблицаСообщенийКОтправке = ТаблицаСообщенийДокумента.СкопироватьКолонки();
		ТаблицаСообщенийКОтправке.Колонки.Добавить("Отправлено", Новый ОписаниеТипов("Булево"));
		ТаблицаСообщенийКОтправке.Колонки.Добавить("ОжидаетПодтвержденияОтправки", Новый ОписаниеТипов("Булево"));
		Для Каждого СтрокаСообщения Из ТаблицаСообщенийДокумента Цикл
			
			Если СтрокаСообщения.СтатусОтправки = Перечисления.СтатусыОтправкиСообщений.НеОтправлено Тогда
				СтрокаСообщенияКОтправке = ТаблицаСообщенийКОтправке.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСообщенияКОтправке, СтрокаСообщения);			
			КонецЕсли;
			
		КонецЦикла;
		
		// Проверка разрешения на отправку этим клиентам писем.
		ТаблицаСообщенийКОтправке.Колонки.Добавить("ОтправкаРазрешена");
		ТаблицаСообщенийКОтправке.ЗаполнитьЗначения(Истина, "ОтправкаРазрешена");
		
		ПутьКВременнымФайлам = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
					ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов()) + "1cemailimg";
		
		// Отправка сообщений
		ТекстHTML = ПолучитьТекстHTMLСИзображениями(ДокументРассылки.Шаблон, ПутьКВременнымФайлам);
		РезультатОтправки = ОтправитьСообщенияEMAIL(ТаблицаСообщенийКОтправке, ТекстHTML);
		Если РезультатОтправки.ОтправленоСообщений <> РезультатОтправки.ОтправлялосьСообщений Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отправлено сообщений " + РезультатОтправки.ОтправленоСообщений + " из " + РезультатОтправки.ОтправлялосьСообщений);
			Если РезультатОтправки.СообщениеОбОшибке.Количество() > 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружены следующие ошибки:");
				Для каждого ТекстОшибки Из РезультатОтправки.СообщениеОбОшибке Цикл
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		КаталогФайлов = Новый Файл(ПутьКВременнымФайлам);
		Если КаталогФайлов.Существует() Тогда 
			УдалитьФайлы(КаталогФайлов.ПолноеИмя);
		КонецЕсли;
		
		// Отметка отправленных сообщений как отправленных и запись набора записей
		Для Каждого СтрокаСообщенияКОтправке Из ТаблицаСообщенийКОтправке Цикл
			
			Если СтрокаСообщенияКОтправке.Отправлено Тогда                                         
				СтрокаСообщения = ТаблицаСообщенийДокумента.Найти(СтрокаСообщенияКОтправке.ВнутреннийИдентификаторСообщения);
				Если СтрокаСообщения <> Неопределено Тогда		
					НаборЗаписейСообщения[ТаблицаСообщенийДокумента.Индекс(СтрокаСообщения)].СтатусОтправки = Перечисления.СтатусыОтправкиСообщений.Отправлена;
					НаборЗаписейСообщения[ТаблицаСообщенийДокумента.Индекс(СтрокаСообщения)].КтоОтправил	= ПараметрыСеанса.ТекущийПользователь;
					НаборЗаписейСообщения[ТаблицаСообщенийДокумента.Индекс(СтрокаСообщения)].ДатаФактическойОтправки = ТекущаяДата();						                                                       
				КонецЕсли;
			КонецЕсли;
			
			Если НаборЗаписейСообщения.Модифицированность() Тогда
				НаборЗаписейСообщения.Записать();
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		РезультатОтправки = Новый Структура("ОтправленоСообщений, ОтправлялосьСообщений, СообщениеОбОшибке",0, 0, Новый Массив);	
		РезультатОтправки.СообщениеОбОшибке.Добавить("Документ рассылки " + ДокументРассылки + " не проведен!");	
	КонецЕсли;
	
	Возврат РезультатОтправки;
	
КонецФункции

Функция ОтправитьСообщенияEMAIL(ТаблицаСообщенийКОтправке, ТекстHTML = Неопределено)
	РезультатОтправки = Новый Структура("ОтправленоСообщений, ОтправлялосьСообщений, СообщениеОбОшибке",0, 0, Новый Массив);
	ТекущаяДата = ТекущаяДата();
	Для каждого Запись ИЗ ТаблицаСообщенийКОтправке Цикл
		Если Не Запись.ОтправкаРазрешена Тогда
			Продолжить;
		КонецЕсли;
		СодержаниеПисьма = Запись.Рассылка.Шаблон;
		УчетнаяЗапись = Запись.Рассылка.УчетнаяЗапись;
		
		Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись);
		Почта = Новый ИнтернетПочта; 

		Кому = Запись.КонтактПолучателя;  
		Тема = СодержаниеПисьма.Тема; 
		Текст = ?(ТекстHTML = Неопределено, СодержаниеПисьма.ТекстHTML, ТекстHTML);
		
		// Вычисляемые параметры
		
		Текст = ВычислитьПараметрыEMAILСообщения(СодержаниеПисьма, Текст, Запись.Получатель, Запись.Источник);
		
		Письмо=Новый ИнтернетПочтовоеСообщение; 
		Письмо.Получатели.Добавить(Кому); 
		Письмо.ИмяОтправителя = УчетнаяЗапись.ИмяПользователя; 
		Письмо.Отправитель=УчетнаяЗапись.АдресЭлектроннойПочты; 
		Письмо.Кодировка="windows-1251"; 
		Письмо.Тема=Тема; 
		Письмо.Тексты.Добавить(Текст,ТипТекстаПочтовогоСообщения.HTML); 
		Письмо.ОбработатьТексты();
		
		Попытка
			Почта=Новый ИнтернетПочта; 
			Почта.Подключиться(Профиль); 
			Почта.Послать(Письмо); 
			Почта.Отключиться(); 
			РезультатОтправки.ОтправленоСообщений = РезультатОтправки.ОтправленоСообщений + 1;
			Запись.Отправлено = Истина;	
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			РезультатОтправки.СообщениеОбОшибке.Добавить("Не удалось подключиться к учетной записи email по указанным параметрам почты:");
			РезультатОтправки.СообщениеОбОшибке.Добавить(ОписаниеОшибки);
		КонецПопытки;
	КонецЦикла;
	РезультатОтправки.ОтправлялосьСообщений = ТаблицаСообщенийКОтправке.Количество();
	Возврат РезультатОтправки;
КонецФункции

Функция ВычислитьПараметрыEMAILСообщения(Знач ШаблонПисьма, Знач ТекстHTML = Неопределено, Знач Получатель, Знач Источник)
	
	Если ТекстHTML = Неопределено Тогда
		ТекстHTML = ШаблонПисьма.ТекстHTML;
	КонецЕсли;
	
	HTMLДокумент = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHTML);
	Для Каждого СтрокаПараметр Из ШаблонПисьма.СоответствияПараметрам Цикл
		Идентификатор = Строка(СтрокаПараметр.Параметр.УникальныйИдентификатор());
		ТекстАлгоритма = СтрокаПараметр.Параметр.АлгоритмВычисления;
		
		Значение = Строка(ВычислитьЗначениеПараметра(ТекстАлгоритма, Получатель, Источник));
		ТекстВставки = РаботаСHTMLКлиентСервер.СформироватьТекстHTMLСПереносами(Значение);
		
		Элементы = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(HTMLДокумент, Идентификатор, "a");
		Для Каждого Элемент Из Элементы Цикл	
			
			РаботаСHTMLКлиентСервер.ЗаменитьЭлементНаПроизвольныйHTML(Элемент, ТекстВставки);
			
		КонецЦикла;	
	КонецЦикла;
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	ЗаписьDOM.Записать(HTMLДокумент, ЗаписьHTML);
	
	Возврат ЗаписьHTML.Закрыть();
	
КонецФункции

Функция ВычислитьЗначениеПараметра(Знач ТекстАлгоритма, Знач Получатель, Знач Источник)
	
	Результат = "";
	Выполнить(ТекстАлгоритма);
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстHTMLСИзображениями(ШаблонПисьма, ПутьКВременномуКаталогу = Неопределено)
	
	Если ШаблонПисьма.СписокИзображений.Количество() = 0 Тогда
		Возврат ШаблонПисьма.ТекстHTML;
	КонецЕсли;
	
	ТекстHTML = ШаблонПисьма.ТекстHTML;
	
	ДокументDOM = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHTML);
	
	Если ПутьКВременномуКаталогу = Неопределено Тогда 
		КаталогФайлов = Новый Файл(
			ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
				ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
					ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов()) + "1cemailimg"));
	Иначе
		КаталогФайлов = Новый Файл(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКВременномуКаталогу));			
	КонецЕсли;
	
	Если Не КаталогФайлов.Существует() Тогда
		СоздатьКаталог(КаталогФайлов.ПолноеИмя);
	КонецЕсли;
	
	Для Каждого ЭлИзобр из ШаблонПисьма.СписокИзображений Цикл
		
		ЭлементDOM = ДокументDOM.ПолучитьЭлементПоИдентификатору(ЭлИзобр.Идентификатор);
		
		Если ЭлементDOM = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьИзобр = КаталогФайлов.ПолноеИмя + ЭлИзобр.Идентификатор + ЭлИзобр.Расширение;
		Base64Значение(ЭлИзобр.ИзображениеBase64).Записать(ПутьИзобр);
		ЭлементDOM.src = ПутьИзобр;
		
	КонецЦикла;
	
	Возврат РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументDOM);
	
КонецФункции

Процедура ОтправитьНеОтправленныеПисьма() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СообщенияЭлектроннойПочты.Рассылка
	               |ИЗ
	               |	РегистрСведений.СообщенияЭлектроннойПочты КАК СообщенияЭлектроннойПочты
	               |ГДЕ
	               |	СообщенияЭлектроннойПочты.СтатусОтправки = &СтатусОтправки
	               |	И СообщенияЭлектроннойПочты.ДатаОтправки < &ДатаОтправки
	               |	И СообщенияЭлектроннойПочты.Рассылка.Проведен
	               |	И НЕ СообщенияЭлектроннойПочты.Рассылка.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СообщенияЭлектроннойПочты.Рассылка";
				   
	Запрос.УстановитьПараметр("СтатусОтправки", Перечисления.СтатусыОтправкиСообщений.НеОтправлено);
	Запрос.УстановитьПараметр("ДатаОтправки", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		РезультатОтправки = ОтправитьНеотправленныеСообщения(Выборка.Рассылка);
		
		Если не ПустаяСтрока(РезультатОтправки.СообщениеОбОшибке) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОтправки.СообщениеОбОшибке);
			
		КонецЕсли;
	
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти
